RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_nsec_reg.h
/* 0x318 : tzc_mm_bmx_s_lock1 */
#define TZC_NSEC_TZC_MM_BMX_S_LOCK1_OFFSET     (0x318)
#define TZC_NSEC_TZC_CODEC_S10_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S10_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S10_TZSID_LOCK_POS  (0U)
#define TZC_NSEC_TZC_CODEC_S10_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S10_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S10_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S10_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S10_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S10_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S10_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S11_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S11_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S11_TZSID_LOCK_POS  (1U)
#define TZC_NSEC_TZC_CODEC_S11_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S11_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S11_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S11_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S11_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S11_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S11_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S12_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S12_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S12_TZSID_LOCK_POS  (2U)
#define TZC_NSEC_TZC_CODEC_S12_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S12_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S12_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S12_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S12_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S12_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S12_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S13_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S13_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S13_TZSID_LOCK_POS  (3U)
#define TZC_NSEC_TZC_CODEC_S13_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S13_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S13_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S13_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S13_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S13_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S13_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S14_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S14_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S14_TZSID_LOCK_POS  (4U)
#define TZC_NSEC_TZC_CODEC_S14_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S14_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S14_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S14_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S14_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S14_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S14_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S15_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S15_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S15_TZSID_LOCK_POS  (5U)
#define TZC_NSEC_TZC_CODEC_S15_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S15_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S15_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S15_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S15_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S15_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S15_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S16_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S16_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S16_TZSID_LOCK_POS  (6U)
#define TZC_NSEC_TZC_CODEC_S16_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S16_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S16_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S16_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S16_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S16_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S16_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S17_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S17_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S17_TZSID_LOCK_POS  (7U)
#define TZC_NSEC_TZC_CODEC_S17_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S17_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S17_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S17_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S17_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S17_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S17_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S18_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S18_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S18_TZSID_LOCK_POS  (8U)
#define TZC_NSEC_TZC_CODEC_S18_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S18_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S18_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S18_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S18_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S18_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S18_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S19_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S19_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S19_TZSID_LOCK_POS  (9U)
#define TZC_NSEC_TZC_CODEC_S19_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S19_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S19_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S19_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S19_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S19_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S19_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S1A_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S1A_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S1A_TZSID_LOCK_POS  (10U)
#define TZC_NSEC_TZC_CODEC_S1A_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S1A_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1A_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1A_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S1A_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1A_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1A_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S1B_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S1B_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S1B_TZSID_LOCK_POS  (11U)
#define TZC_NSEC_TZC_CODEC_S1B_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S1B_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1B_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1B_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S1B_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1B_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1B_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S1C_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S1C_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S1C_TZSID_LOCK_POS  (12U)
#define TZC_NSEC_TZC_CODEC_S1C_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S1C_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1C_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1C_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S1C_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1C_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1C_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S1D_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S1D_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S1D_TZSID_LOCK_POS  (13U)
#define TZC_NSEC_TZC_CODEC_S1D_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S1D_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1D_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1D_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S1D_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1D_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1D_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S1E_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S1E_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S1E_TZSID_LOCK_POS  (14U)
#define TZC_NSEC_TZC_CODEC_S1E_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S1E_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1E_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1E_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S1E_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1E_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1E_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_CODEC_S1F_TZSID_LOCK      TZC_NSEC_TZC_CODEC_S1F_TZSID_LOCK
#define TZC_NSEC_TZC_CODEC_S1F_TZSID_LOCK_POS  (15U)
#define TZC_NSEC_TZC_CODEC_S1F_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_CODEC_S1F_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_CODEC_S1F_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1F_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_CODEC_S1F_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_CODEC_S1F_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_CODEC_S1F_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S10_TZSID_LOCK            TZC_NSEC_TZC_S10_TZSID_LOCK
#define TZC_NSEC_TZC_S10_TZSID_LOCK_POS        (16U)
#define TZC_NSEC_TZC_S10_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S10_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S10_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S10_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S10_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S10_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S10_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S11_TZSID_LOCK            TZC_NSEC_TZC_S11_TZSID_LOCK
#define TZC_NSEC_TZC_S11_TZSID_LOCK_POS        (17U)
#define TZC_NSEC_TZC_S11_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S11_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S11_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S11_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S11_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S11_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S11_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S12_TZSID_LOCK            TZC_NSEC_TZC_S12_TZSID_LOCK
#define TZC_NSEC_TZC_S12_TZSID_LOCK_POS        (18U)
#define TZC_NSEC_TZC_S12_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S12_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S12_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S12_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S12_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S12_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S12_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S13_TZSID_LOCK            TZC_NSEC_TZC_S13_TZSID_LOCK
#define TZC_NSEC_TZC_S13_TZSID_LOCK_POS        (19U)
#define TZC_NSEC_TZC_S13_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S13_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S13_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S13_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S13_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S13_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S13_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S14_TZSID_LOCK            TZC_NSEC_TZC_S14_TZSID_LOCK
#define TZC_NSEC_TZC_S14_TZSID_LOCK_POS        (20U)
#define TZC_NSEC_TZC_S14_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S14_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S14_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S14_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S14_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S14_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S14_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S15_TZSID_LOCK            TZC_NSEC_TZC_S15_TZSID_LOCK
#define TZC_NSEC_TZC_S15_TZSID_LOCK_POS        (21U)
#define TZC_NSEC_TZC_S15_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S15_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S15_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S15_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S15_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S15_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S15_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S16_TZSID_LOCK            TZC_NSEC_TZC_S16_TZSID_LOCK
#define TZC_NSEC_TZC_S16_TZSID_LOCK_POS        (22U)
#define TZC_NSEC_TZC_S16_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S16_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S16_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S16_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S16_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S16_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S16_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S17_TZSID_LOCK            TZC_NSEC_TZC_S17_TZSID_LOCK
#define TZC_NSEC_TZC_S17_TZSID_LOCK_POS        (23U)
#define TZC_NSEC_TZC_S17_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S17_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S17_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S17_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S17_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S17_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S17_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S18_TZSID_LOCK            TZC_NSEC_TZC_S18_TZSID_LOCK
#define TZC_NSEC_TZC_S18_TZSID_LOCK_POS        (24U)
#define TZC_NSEC_TZC_S18_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S18_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S18_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S18_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S18_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S18_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S18_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S19_TZSID_LOCK            TZC_NSEC_TZC_S19_TZSID_LOCK
#define TZC_NSEC_TZC_S19_TZSID_LOCK_POS        (25U)
#define TZC_NSEC_TZC_S19_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S19_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S19_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S19_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S19_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S19_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S19_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S1A_TZSID_LOCK            TZC_NSEC_TZC_S1A_TZSID_LOCK
#define TZC_NSEC_TZC_S1A_TZSID_LOCK_POS        (26U)
#define TZC_NSEC_TZC_S1A_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S1A_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S1A_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1A_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S1A_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S1A_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1A_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S1B_TZSID_LOCK            TZC_NSEC_TZC_S1B_TZSID_LOCK
#define TZC_NSEC_TZC_S1B_TZSID_LOCK_POS        (27U)
#define TZC_NSEC_TZC_S1B_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S1B_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S1B_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1B_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S1B_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S1B_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1B_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S1C_TZSID_LOCK            TZC_NSEC_TZC_S1C_TZSID_LOCK
#define TZC_NSEC_TZC_S1C_TZSID_LOCK_POS        (28U)
#define TZC_NSEC_TZC_S1C_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S1C_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S1C_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1C_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S1C_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S1C_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1C_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S1D_TZSID_LOCK            TZC_NSEC_TZC_S1D_TZSID_LOCK
#define TZC_NSEC_TZC_S1D_TZSID_LOCK_POS        (29U)
#define TZC_NSEC_TZC_S1D_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S1D_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S1D_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1D_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S1D_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S1D_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1D_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S1E_TZSID_LOCK            TZC_NSEC_TZC_S1E_TZSID_LOCK
#define TZC_NSEC_TZC_S1E_TZSID_LOCK_POS        (30U)
#define TZC_NSEC_TZC_S1E_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S1E_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S1E_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1E_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S1E_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S1E_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1E_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_S1F_TZSID_LOCK            TZC_NSEC_TZC_S1F_TZSID_LOCK
#define TZC_NSEC_TZC_S1F_TZSID_LOCK_POS        (31U)
#define TZC_NSEC_TZC_S1F_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_S1F_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_S1F_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1F_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_S1F_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_S1F_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_S1F_TZSID_LOCK_POS))

/* 0x340 : tzc_l2sram_tzsrg_ctrl */
#define TZC_NSEC_TZC_L2SRAM_TZSRG_CTRL_OFFSET   (0x340)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_ID_EN      TZC_NSEC_TZC_L2SRAM_TZSRG_R0_ID_EN
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_ID_EN_POS  (0U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_ID_EN_LEN  (2U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_ID_EN_MSK  (((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_ID_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_ID_EN_POS)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_ID_EN_UMSK (~(((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_ID_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_ID_EN_POS))
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_ID_EN      TZC_NSEC_TZC_L2SRAM_TZSRG_R1_ID_EN
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_ID_EN_POS  (2U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_ID_EN_LEN  (2U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_ID_EN_MSK  (((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_ID_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_ID_EN_POS)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_ID_EN_UMSK (~(((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_ID_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_ID_EN_POS))
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_ID_EN      TZC_NSEC_TZC_L2SRAM_TZSRG_R2_ID_EN
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_ID_EN_POS  (4U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_ID_EN_LEN  (2U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_ID_EN_MSK  (((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_ID_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_ID_EN_POS)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_ID_EN_UMSK (~(((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_ID_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_ID_EN_POS))
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_EN         TZC_NSEC_TZC_L2SRAM_TZSRG_R0_EN
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_EN_POS     (16U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_EN_LEN     (1U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_EN_MSK     (((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_EN_POS)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_EN_UMSK    (~(((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_EN_POS))
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_EN         TZC_NSEC_TZC_L2SRAM_TZSRG_R1_EN
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_EN_POS     (17U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_EN_LEN     (1U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_EN_MSK     (((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_EN_POS)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_EN_UMSK    (~(((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_EN_POS))
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_EN         TZC_NSEC_TZC_L2SRAM_TZSRG_R2_EN
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_EN_POS     (18U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_EN_LEN     (1U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_EN_MSK     (((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_EN_POS)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_EN_UMSK    (~(((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_EN_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_EN_POS))
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_LOCK       TZC_NSEC_TZC_L2SRAM_TZSRG_R0_LOCK
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_LOCK_POS   (24U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_LOCK_MSK   (((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_LOCK_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_LOCK_POS)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R0_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_LOCK_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R0_LOCK_POS))
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_LOCK       TZC_NSEC_TZC_L2SRAM_TZSRG_R1_LOCK
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_LOCK_POS   (25U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_LOCK_MSK   (((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_LOCK_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_LOCK_POS)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R1_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_LOCK_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R1_LOCK_POS))
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_LOCK       TZC_NSEC_TZC_L2SRAM_TZSRG_R2_LOCK
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_LOCK_POS   (26U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_LOCK_MSK   (((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_LOCK_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_LOCK_POS)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_R2_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_LOCK_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_R2_LOCK_POS))

/* 0x344 : tzc_l2sram_tzsrg_adr_mask */
#define TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_OFFSET    (0x344)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK           TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK
#define TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_POS       (0U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LEN       (10U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_MSK       (((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_POS)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_UMSK      (~(((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_POS))
#define TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LOCK      TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LOCK
#define TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LOCK_POS  (16U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LOCK_MSK  (((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LOCK_POS)
#define TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_NSEC_TZC_L2SRAM_TZSRG_ADR_MASK_LOCK_POS))

