RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_nsec_reg.h
/* 0x3D4 : tzc_xram_tzsrg_r3 */
#define TZC_NSEC_TZC_XRAM_TZSRG_R3_OFFSET (0x3D4)

/* 0xF00 : tzc_glb_ctrl_0 */
#define TZC_NSEC_TZC_GLB_CTRL_0_OFFSET            (0xF00)
#define TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_EN       TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_EN
#define TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_EN_POS   (0U)
#define TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_EN_LEN   (2U)
#define TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_EN_MSK   (((1U << TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_EN_UMSK  (~(((1U << TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_EN       TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_EN
#define TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_EN_POS   (2U)
#define TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_EN_LEN   (2U)
#define TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_EN_MSK   (((1U << TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_EN_UMSK  (~(((1U << TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_EN       TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_EN
#define TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_EN_POS   (4U)
#define TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_EN_LEN   (2U)
#define TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_EN_MSK   (((1U << TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_EN_UMSK  (~(((1U << TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_EN      TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_EN
#define TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_EN_POS  (6U)
#define TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_MISC_TZSID_EN            TZC_NSEC_TZC_GLB_MISC_TZSID_EN
#define TZC_NSEC_TZC_GLB_MISC_TZSID_EN_POS        (8U)
#define TZC_NSEC_TZC_GLB_MISC_TZSID_EN_LEN        (2U)
#define TZC_NSEC_TZC_GLB_MISC_TZSID_EN_MSK        (((1U << TZC_NSEC_TZC_GLB_MISC_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_MISC_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_MISC_TZSID_EN_UMSK       (~(((1U << TZC_NSEC_TZC_GLB_MISC_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_MISC_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_SRAM_TZSID_EN            TZC_NSEC_TZC_GLB_SRAM_TZSID_EN
#define TZC_NSEC_TZC_GLB_SRAM_TZSID_EN_POS        (10U)
#define TZC_NSEC_TZC_GLB_SRAM_TZSID_EN_LEN        (2U)
#define TZC_NSEC_TZC_GLB_SRAM_TZSID_EN_MSK        (((1U << TZC_NSEC_TZC_GLB_SRAM_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_SRAM_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_SRAM_TZSID_EN_UMSK       (~(((1U << TZC_NSEC_TZC_GLB_SRAM_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_SRAM_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_SWRST_TZSID_EN           TZC_NSEC_TZC_GLB_SWRST_TZSID_EN
#define TZC_NSEC_TZC_GLB_SWRST_TZSID_EN_POS       (12U)
#define TZC_NSEC_TZC_GLB_SWRST_TZSID_EN_LEN       (2U)
#define TZC_NSEC_TZC_GLB_SWRST_TZSID_EN_MSK       (((1U << TZC_NSEC_TZC_GLB_SWRST_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_SWRST_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_SWRST_TZSID_EN_UMSK      (~(((1U << TZC_NSEC_TZC_GLB_SWRST_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_SWRST_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_BMX_TZSID_EN             TZC_NSEC_TZC_GLB_BMX_TZSID_EN
#define TZC_NSEC_TZC_GLB_BMX_TZSID_EN_POS         (14U)
#define TZC_NSEC_TZC_GLB_BMX_TZSID_EN_LEN         (2U)
#define TZC_NSEC_TZC_GLB_BMX_TZSID_EN_MSK         (((1U << TZC_NSEC_TZC_GLB_BMX_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_BMX_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_BMX_TZSID_EN_UMSK        (~(((1U << TZC_NSEC_TZC_GLB_BMX_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_BMX_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_DBG_TZSID_EN             TZC_NSEC_TZC_GLB_DBG_TZSID_EN
#define TZC_NSEC_TZC_GLB_DBG_TZSID_EN_POS         (16U)
#define TZC_NSEC_TZC_GLB_DBG_TZSID_EN_LEN         (2U)
#define TZC_NSEC_TZC_GLB_DBG_TZSID_EN_MSK         (((1U << TZC_NSEC_TZC_GLB_DBG_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_DBG_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_DBG_TZSID_EN_UMSK        (~(((1U << TZC_NSEC_TZC_GLB_DBG_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_DBG_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_MBIST_TZSID_EN           TZC_NSEC_TZC_GLB_MBIST_TZSID_EN
#define TZC_NSEC_TZC_GLB_MBIST_TZSID_EN_POS       (18U)
#define TZC_NSEC_TZC_GLB_MBIST_TZSID_EN_LEN       (2U)
#define TZC_NSEC_TZC_GLB_MBIST_TZSID_EN_MSK       (((1U << TZC_NSEC_TZC_GLB_MBIST_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_MBIST_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_MBIST_TZSID_EN_UMSK      (~(((1U << TZC_NSEC_TZC_GLB_MBIST_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_MBIST_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_CLK_TZSID_EN             TZC_NSEC_TZC_GLB_CLK_TZSID_EN
#define TZC_NSEC_TZC_GLB_CLK_TZSID_EN_POS         (20U)
#define TZC_NSEC_TZC_GLB_CLK_TZSID_EN_LEN         (2U)
#define TZC_NSEC_TZC_GLB_CLK_TZSID_EN_MSK         (((1U << TZC_NSEC_TZC_GLB_CLK_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_CLK_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_CLK_TZSID_EN_UMSK        (~(((1U << TZC_NSEC_TZC_GLB_CLK_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_CLK_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_INT_TZSID_EN             TZC_NSEC_TZC_GLB_INT_TZSID_EN
#define TZC_NSEC_TZC_GLB_INT_TZSID_EN_POS         (22U)
#define TZC_NSEC_TZC_GLB_INT_TZSID_EN_LEN         (2U)
#define TZC_NSEC_TZC_GLB_INT_TZSID_EN_MSK         (((1U << TZC_NSEC_TZC_GLB_INT_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_INT_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_INT_TZSID_EN_UMSK        (~(((1U << TZC_NSEC_TZC_GLB_INT_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_INT_TZSID_EN_POS))
#define TZC_NSEC_TZC_GLB_PWR_TZSID_EN             TZC_NSEC_TZC_GLB_PWR_TZSID_EN
#define TZC_NSEC_TZC_GLB_PWR_TZSID_EN_POS         (24U)
#define TZC_NSEC_TZC_GLB_PWR_TZSID_EN_LEN         (2U)
#define TZC_NSEC_TZC_GLB_PWR_TZSID_EN_MSK         (((1U << TZC_NSEC_TZC_GLB_PWR_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_PWR_TZSID_EN_POS)
#define TZC_NSEC_TZC_GLB_PWR_TZSID_EN_UMSK        (~(((1U << TZC_NSEC_TZC_GLB_PWR_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_GLB_PWR_TZSID_EN_POS))

/* 0xF04 : tzc_glb_ctrl_1 */
#define TZC_NSEC_TZC_GLB_CTRL_1_OFFSET (0xF04)

/* 0xF08 : tzc_glb_ctrl_2 */
#define TZC_NSEC_TZC_GLB_CTRL_2_OFFSET              (0xF08)
#define TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_LOCK       TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_LOCK_POS   (0U)
#define TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_LOCK_MSK   (((1U << TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_PWRON_RST_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_LOCK       TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_LOCK_POS   (1U)
#define TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_LOCK_MSK   (((1U << TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_CPU_RESET_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_LOCK       TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_LOCK_POS   (2U)
#define TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_LOCK_MSK   (((1U << TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_SYS_RESET_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_LOCK      TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_LOCK_POS  (3U)
#define TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_CPU2_RESET_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_MISC_TZSID_LOCK            TZC_NSEC_TZC_GLB_MISC_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_MISC_TZSID_LOCK_POS        (4U)
#define TZC_NSEC_TZC_GLB_MISC_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_GLB_MISC_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_GLB_MISC_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_MISC_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_MISC_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_GLB_MISC_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_MISC_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_SRAM_TZSID_LOCK            TZC_NSEC_TZC_GLB_SRAM_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_SRAM_TZSID_LOCK_POS        (5U)
#define TZC_NSEC_TZC_GLB_SRAM_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_GLB_SRAM_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_GLB_SRAM_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_SRAM_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_SRAM_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_GLB_SRAM_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_SRAM_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_SWRST_TZSID_LOCK           TZC_NSEC_TZC_GLB_SWRST_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_SWRST_TZSID_LOCK_POS       (6U)
#define TZC_NSEC_TZC_GLB_SWRST_TZSID_LOCK_LEN       (1U)
#define TZC_NSEC_TZC_GLB_SWRST_TZSID_LOCK_MSK       (((1U << TZC_NSEC_TZC_GLB_SWRST_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_SWRST_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_SWRST_TZSID_LOCK_UMSK      (~(((1U << TZC_NSEC_TZC_GLB_SWRST_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_SWRST_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_BMX_TZSID_LOCK             TZC_NSEC_TZC_GLB_BMX_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_BMX_TZSID_LOCK_POS         (7U)
#define TZC_NSEC_TZC_GLB_BMX_TZSID_LOCK_LEN         (1U)
#define TZC_NSEC_TZC_GLB_BMX_TZSID_LOCK_MSK         (((1U << TZC_NSEC_TZC_GLB_BMX_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_BMX_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_BMX_TZSID_LOCK_UMSK        (~(((1U << TZC_NSEC_TZC_GLB_BMX_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_BMX_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_DBG_TZSID_LOCK             TZC_NSEC_TZC_GLB_DBG_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_DBG_TZSID_LOCK_POS         (8U)
#define TZC_NSEC_TZC_GLB_DBG_TZSID_LOCK_LEN         (1U)
#define TZC_NSEC_TZC_GLB_DBG_TZSID_LOCK_MSK         (((1U << TZC_NSEC_TZC_GLB_DBG_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_DBG_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_DBG_TZSID_LOCK_UMSK        (~(((1U << TZC_NSEC_TZC_GLB_DBG_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_DBG_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_MBIST_TZSID_LOCK           TZC_NSEC_TZC_GLB_MBIST_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_MBIST_TZSID_LOCK_POS       (9U)
#define TZC_NSEC_TZC_GLB_MBIST_TZSID_LOCK_LEN       (1U)
#define TZC_NSEC_TZC_GLB_MBIST_TZSID_LOCK_MSK       (((1U << TZC_NSEC_TZC_GLB_MBIST_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_MBIST_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_MBIST_TZSID_LOCK_UMSK      (~(((1U << TZC_NSEC_TZC_GLB_MBIST_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_MBIST_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_CLK_TZSID_LOCK             TZC_NSEC_TZC_GLB_CLK_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_CLK_TZSID_LOCK_POS         (10U)
#define TZC_NSEC_TZC_GLB_CLK_TZSID_LOCK_LEN         (1U)
#define TZC_NSEC_TZC_GLB_CLK_TZSID_LOCK_MSK         (((1U << TZC_NSEC_TZC_GLB_CLK_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_CLK_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_CLK_TZSID_LOCK_UMSK        (~(((1U << TZC_NSEC_TZC_GLB_CLK_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_CLK_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_INT_TZSID_LOCK             TZC_NSEC_TZC_GLB_INT_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_INT_TZSID_LOCK_POS         (11U)
#define TZC_NSEC_TZC_GLB_INT_TZSID_LOCK_LEN         (1U)
#define TZC_NSEC_TZC_GLB_INT_TZSID_LOCK_MSK         (((1U << TZC_NSEC_TZC_GLB_INT_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_INT_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_INT_TZSID_LOCK_UMSK        (~(((1U << TZC_NSEC_TZC_GLB_INT_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_INT_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_GLB_PWR_TZSID_LOCK             TZC_NSEC_TZC_GLB_PWR_TZSID_LOCK
#define TZC_NSEC_TZC_GLB_PWR_TZSID_LOCK_POS         (12U)
#define TZC_NSEC_TZC_GLB_PWR_TZSID_LOCK_LEN         (1U)
#define TZC_NSEC_TZC_GLB_PWR_TZSID_LOCK_MSK         (((1U << TZC_NSEC_TZC_GLB_PWR_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_PWR_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_GLB_PWR_TZSID_LOCK_UMSK        (~(((1U << TZC_NSEC_TZC_GLB_PWR_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_GLB_PWR_TZSID_LOCK_POS))

/* 0xF20 : tzc_mm_ctrl_0 */
#define TZC_NSEC_TZC_MM_CTRL_0_OFFSET            (0xF20)
#define TZC_NSEC_TZC_MM_PWRON_RST_TZSID_EN       TZC_NSEC_TZC_MM_PWRON_RST_TZSID_EN
#define TZC_NSEC_TZC_MM_PWRON_RST_TZSID_EN_POS   (0U)
#define TZC_NSEC_TZC_MM_PWRON_RST_TZSID_EN_LEN   (2U)
#define TZC_NSEC_TZC_MM_PWRON_RST_TZSID_EN_MSK   (((1U << TZC_NSEC_TZC_MM_PWRON_RST_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_PWRON_RST_TZSID_EN_POS)
#define TZC_NSEC_TZC_MM_PWRON_RST_TZSID_EN_UMSK  (~(((1U << TZC_NSEC_TZC_MM_PWRON_RST_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_PWRON_RST_TZSID_EN_POS))
#define TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_EN      TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_EN
#define TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_EN_POS  (2U)
#define TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_EN_POS)
#define TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_EN_POS))
#define TZC_NSEC_TZC_MM_SYS_RESET_TZSID_EN       TZC_NSEC_TZC_MM_SYS_RESET_TZSID_EN
#define TZC_NSEC_TZC_MM_SYS_RESET_TZSID_EN_POS   (4U)
#define TZC_NSEC_TZC_MM_SYS_RESET_TZSID_EN_LEN   (2U)
#define TZC_NSEC_TZC_MM_SYS_RESET_TZSID_EN_MSK   (((1U << TZC_NSEC_TZC_MM_SYS_RESET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_SYS_RESET_TZSID_EN_POS)
#define TZC_NSEC_TZC_MM_SYS_RESET_TZSID_EN_UMSK  (~(((1U << TZC_NSEC_TZC_MM_SYS_RESET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_SYS_RESET_TZSID_EN_POS))
#define TZC_NSEC_TZC_MM_CPU0_TZSID_EN            TZC_NSEC_TZC_MM_CPU0_TZSID_EN
#define TZC_NSEC_TZC_MM_CPU0_TZSID_EN_POS        (6U)
#define TZC_NSEC_TZC_MM_CPU0_TZSID_EN_LEN        (2U)
#define TZC_NSEC_TZC_MM_CPU0_TZSID_EN_MSK        (((1U << TZC_NSEC_TZC_MM_CPU0_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_CPU0_TZSID_EN_POS)
#define TZC_NSEC_TZC_MM_CPU0_TZSID_EN_UMSK       (~(((1U << TZC_NSEC_TZC_MM_CPU0_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_CPU0_TZSID_EN_POS))
#define TZC_NSEC_TZC_MM_SRAM_TZSID_EN            TZC_NSEC_TZC_MM_SRAM_TZSID_EN
#define TZC_NSEC_TZC_MM_SRAM_TZSID_EN_POS        (10U)
#define TZC_NSEC_TZC_MM_SRAM_TZSID_EN_LEN        (2U)
#define TZC_NSEC_TZC_MM_SRAM_TZSID_EN_MSK        (((1U << TZC_NSEC_TZC_MM_SRAM_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_SRAM_TZSID_EN_POS)
#define TZC_NSEC_TZC_MM_SRAM_TZSID_EN_UMSK       (~(((1U << TZC_NSEC_TZC_MM_SRAM_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_SRAM_TZSID_EN_POS))
#define TZC_NSEC_TZC_MM_SWRST_TZSID_EN           TZC_NSEC_TZC_MM_SWRST_TZSID_EN
#define TZC_NSEC_TZC_MM_SWRST_TZSID_EN_POS       (12U)
#define TZC_NSEC_TZC_MM_SWRST_TZSID_EN_LEN       (2U)
#define TZC_NSEC_TZC_MM_SWRST_TZSID_EN_MSK       (((1U << TZC_NSEC_TZC_MM_SWRST_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_SWRST_TZSID_EN_POS)
#define TZC_NSEC_TZC_MM_SWRST_TZSID_EN_UMSK      (~(((1U << TZC_NSEC_TZC_MM_SWRST_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_SWRST_TZSID_EN_POS))
#define TZC_NSEC_TZC_MM_CLK_TZSID_EN             TZC_NSEC_TZC_MM_CLK_TZSID_EN
#define TZC_NSEC_TZC_MM_CLK_TZSID_EN_POS         (20U)
#define TZC_NSEC_TZC_MM_CLK_TZSID_EN_LEN         (2U)
#define TZC_NSEC_TZC_MM_CLK_TZSID_EN_MSK         (((1U << TZC_NSEC_TZC_MM_CLK_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_CLK_TZSID_EN_POS)
#define TZC_NSEC_TZC_MM_CLK_TZSID_EN_UMSK        (~(((1U << TZC_NSEC_TZC_MM_CLK_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_MM_CLK_TZSID_EN_POS))

/* 0xF24 : tzc_mm_ctrl_1 */
#define TZC_NSEC_TZC_MM_CTRL_1_OFFSET (0xF24)

/* 0xF28 : tzc_mm_ctrl_2 */
#define TZC_NSEC_TZC_MM_CTRL_2_OFFSET              (0xF28)
#define TZC_NSEC_TZC_MM_PWRON_RST_TZSID_LOCK       TZC_NSEC_TZC_MM_PWRON_RST_TZSID_LOCK
#define TZC_NSEC_TZC_MM_PWRON_RST_TZSID_LOCK_POS   (0U)
#define TZC_NSEC_TZC_MM_PWRON_RST_TZSID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_MM_PWRON_RST_TZSID_LOCK_MSK   (((1U << TZC_NSEC_TZC_MM_PWRON_RST_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_PWRON_RST_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MM_PWRON_RST_TZSID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_MM_PWRON_RST_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_PWRON_RST_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_LOCK      TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_LOCK
#define TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_LOCK_POS  (1U)
#define TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_LOCK_LEN  (1U)
#define TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_LOCK_MSK  (((1U << TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_LOCK_UMSK (~(((1U << TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_CPU0_RESET_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MM_SYS_RESET_TZSID_LOCK       TZC_NSEC_TZC_MM_SYS_RESET_TZSID_LOCK
#define TZC_NSEC_TZC_MM_SYS_RESET_TZSID_LOCK_POS   (2U)
#define TZC_NSEC_TZC_MM_SYS_RESET_TZSID_LOCK_LEN   (1U)
#define TZC_NSEC_TZC_MM_SYS_RESET_TZSID_LOCK_MSK   (((1U << TZC_NSEC_TZC_MM_SYS_RESET_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_SYS_RESET_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MM_SYS_RESET_TZSID_LOCK_UMSK  (~(((1U << TZC_NSEC_TZC_MM_SYS_RESET_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_SYS_RESET_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MM_CPU0_TZSID_LOCK            TZC_NSEC_TZC_MM_CPU0_TZSID_LOCK
#define TZC_NSEC_TZC_MM_CPU0_TZSID_LOCK_POS        (3U)
#define TZC_NSEC_TZC_MM_CPU0_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_MM_CPU0_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_MM_CPU0_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_CPU0_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MM_CPU0_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_MM_CPU0_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_CPU0_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MM_SRAM_TZSID_LOCK            TZC_NSEC_TZC_MM_SRAM_TZSID_LOCK
#define TZC_NSEC_TZC_MM_SRAM_TZSID_LOCK_POS        (5U)
#define TZC_NSEC_TZC_MM_SRAM_TZSID_LOCK_LEN        (1U)
#define TZC_NSEC_TZC_MM_SRAM_TZSID_LOCK_MSK        (((1U << TZC_NSEC_TZC_MM_SRAM_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_SRAM_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MM_SRAM_TZSID_LOCK_UMSK       (~(((1U << TZC_NSEC_TZC_MM_SRAM_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_SRAM_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MM_SWRST_TZSID_LOCK           TZC_NSEC_TZC_MM_SWRST_TZSID_LOCK
#define TZC_NSEC_TZC_MM_SWRST_TZSID_LOCK_POS       (6U)
#define TZC_NSEC_TZC_MM_SWRST_TZSID_LOCK_LEN       (1U)
#define TZC_NSEC_TZC_MM_SWRST_TZSID_LOCK_MSK       (((1U << TZC_NSEC_TZC_MM_SWRST_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_SWRST_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MM_SWRST_TZSID_LOCK_UMSK      (~(((1U << TZC_NSEC_TZC_MM_SWRST_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_SWRST_TZSID_LOCK_POS))
#define TZC_NSEC_TZC_MM_CLK_TZSID_LOCK             TZC_NSEC_TZC_MM_CLK_TZSID_LOCK
#define TZC_NSEC_TZC_MM_CLK_TZSID_LOCK_POS         (10U)
#define TZC_NSEC_TZC_MM_CLK_TZSID_LOCK_LEN         (1U)
#define TZC_NSEC_TZC_MM_CLK_TZSID_LOCK_MSK         (((1U << TZC_NSEC_TZC_MM_CLK_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_CLK_TZSID_LOCK_POS)
#define TZC_NSEC_TZC_MM_CLK_TZSID_LOCK_UMSK        (~(((1U << TZC_NSEC_TZC_MM_CLK_TZSID_LOCK_LEN) - 1) << TZC_NSEC_TZC_MM_CLK_TZSID_LOCK_POS))

/* 0xF40 : tzc_se_ctrl_0 */
#define TZC_NSEC_TZC_SE_CTRL_0_OFFSET      (0xF40)
#define TZC_NSEC_TZC_SE_SHA_TZSID_EN       TZC_NSEC_TZC_SE_SHA_TZSID_EN
#define TZC_NSEC_TZC_SE_SHA_TZSID_EN_POS   (0U)
#define TZC_NSEC_TZC_SE_SHA_TZSID_EN_LEN   (2U)
#define TZC_NSEC_TZC_SE_SHA_TZSID_EN_MSK   (((1U << TZC_NSEC_TZC_SE_SHA_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_SHA_TZSID_EN_POS)
#define TZC_NSEC_TZC_SE_SHA_TZSID_EN_UMSK  (~(((1U << TZC_NSEC_TZC_SE_SHA_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_SHA_TZSID_EN_POS))
#define TZC_NSEC_TZC_SE_AES_TZSID_EN       TZC_NSEC_TZC_SE_AES_TZSID_EN
#define TZC_NSEC_TZC_SE_AES_TZSID_EN_POS   (2U)
#define TZC_NSEC_TZC_SE_AES_TZSID_EN_LEN   (2U)
#define TZC_NSEC_TZC_SE_AES_TZSID_EN_MSK   (((1U << TZC_NSEC_TZC_SE_AES_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_AES_TZSID_EN_POS)
#define TZC_NSEC_TZC_SE_AES_TZSID_EN_UMSK  (~(((1U << TZC_NSEC_TZC_SE_AES_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_AES_TZSID_EN_POS))
#define TZC_NSEC_TZC_SE_TRNG_TZSID_EN      TZC_NSEC_TZC_SE_TRNG_TZSID_EN
#define TZC_NSEC_TZC_SE_TRNG_TZSID_EN_POS  (4U)
#define TZC_NSEC_TZC_SE_TRNG_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_SE_TRNG_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_SE_TRNG_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_TRNG_TZSID_EN_POS)
#define TZC_NSEC_TZC_SE_TRNG_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_SE_TRNG_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_TRNG_TZSID_EN_POS))
#define TZC_NSEC_TZC_SE_PKA_TZSID_EN       TZC_NSEC_TZC_SE_PKA_TZSID_EN
#define TZC_NSEC_TZC_SE_PKA_TZSID_EN_POS   (6U)
#define TZC_NSEC_TZC_SE_PKA_TZSID_EN_LEN   (2U)
#define TZC_NSEC_TZC_SE_PKA_TZSID_EN_MSK   (((1U << TZC_NSEC_TZC_SE_PKA_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_PKA_TZSID_EN_POS)
#define TZC_NSEC_TZC_SE_PKA_TZSID_EN_UMSK  (~(((1U << TZC_NSEC_TZC_SE_PKA_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_PKA_TZSID_EN_POS))
#define TZC_NSEC_TZC_SE_CDET_TZSID_EN      TZC_NSEC_TZC_SE_CDET_TZSID_EN
#define TZC_NSEC_TZC_SE_CDET_TZSID_EN_POS  (8U)
#define TZC_NSEC_TZC_SE_CDET_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_SE_CDET_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_SE_CDET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_CDET_TZSID_EN_POS)
#define TZC_NSEC_TZC_SE_CDET_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_SE_CDET_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_CDET_TZSID_EN_POS))
#define TZC_NSEC_TZC_SE_GMAC_TZSID_EN      TZC_NSEC_TZC_SE_GMAC_TZSID_EN
#define TZC_NSEC_TZC_SE_GMAC_TZSID_EN_POS  (10U)
#define TZC_NSEC_TZC_SE_GMAC_TZSID_EN_LEN  (2U)
#define TZC_NSEC_TZC_SE_GMAC_TZSID_EN_MSK  (((1U << TZC_NSEC_TZC_SE_GMAC_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_GMAC_TZSID_EN_POS)
#define TZC_NSEC_TZC_SE_GMAC_TZSID_EN_UMSK (~(((1U << TZC_NSEC_TZC_SE_GMAC_TZSID_EN_LEN) - 1) << TZC_NSEC_TZC_SE_GMAC_TZSID_EN_POS))
#define TZC_NSEC_TZC_SE_TZSID_CRMD         TZC_NSEC_TZC_SE_TZSID_CRMD
#define TZC_NSEC_TZC_SE_TZSID_CRMD_POS     (12U)
#define TZC_NSEC_TZC_SE_TZSID_CRMD_LEN     (1U)
#define TZC_NSEC_TZC_SE_TZSID_CRMD_MSK     (((1U << TZC_NSEC_TZC_SE_TZSID_CRMD_LEN) - 1) << TZC_NSEC_TZC_SE_TZSID_CRMD_POS)
#define TZC_NSEC_TZC_SE_TZSID_CRMD_UMSK    (~(((1U << TZC_NSEC_TZC_SE_TZSID_CRMD_LEN) - 1) << TZC_NSEC_TZC_SE_TZSID_CRMD_POS))
#define TZC_NSEC_TZC_SE_WDT_DLY            TZC_NSEC_TZC_SE_WDT_DLY
#define TZC_NSEC_TZC_SE_WDT_DLY_POS        (16U)
#define TZC_NSEC_TZC_SE_WDT_DLY_LEN        (16U)
#define TZC_NSEC_TZC_SE_WDT_DLY_MSK        (((1U << TZC_NSEC_TZC_SE_WDT_DLY_LEN) - 1) << TZC_NSEC_TZC_SE_WDT_DLY_POS)
#define TZC_NSEC_TZC_SE_WDT_DLY_UMSK       (~(((1U << TZC_NSEC_TZC_SE_WDT_DLY_LEN) - 1) << TZC_NSEC_TZC_SE_WDT_DLY_POS))

